# FilterNumericValueRule Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilterNumericValueRule Properties
FilterNumericValueRule Class See Also
---
The FilterNumericValueRule type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from FilterRule.) |

# See Also
FilterNumericValueRule Class
Autodesk.Revit.DB Namespace